<?php

/*******************************************
 * Интерфейс Команды объявляет метод для выполнения команд.
 *******************************************************************
 */
interface Command
{
    public function exe();
}

/*******************************************
 * Управляет запуском команд
 *******************************************************************
 */
class CargaDes
{
    public $onStart;

    /*******************************************
     * Инициализация команд.
     *******************************************************************
     * @param Command $command
     */
    public function setOnStart(Command $command)
    {
        $this->onStart = $command;
    }

    /*******************************************
     * Старт выбранной команды
     *******************************************************************
     */
    public function Start()
    {
        if ($this->onStart instanceof Command) {
            return $this->onStart->exe();
        }
        return true;
    }
}